app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def inventory
    product = Product.find(params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
  def description
    product = Product.find(params[:id])

INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["price", 3], ["created_at", "2019-09-18 18:54:05.264613"], ["updated_at", "2019-09-18 18:54:05.264613"], ["inventory", 12], ["description", "This is a great thing"]]
---
  def create
    Product.create(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 338]]
---
  def data
    product = Product.find(params[:id])